Catalogs/Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Проекты</Name>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Проект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновнаяСтатьяДоходовИРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновнаяСтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновнойКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновнойДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновнаяВалютаПлатежей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИИТ_МОРС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроектЭтапа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФункциональноеНаправление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункциональныеНаправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РазделИнвестиционнойПрограммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыИнвестиционныхПрограмм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АС_ПроектУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АС_КонтрольБР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИИТ_Согласующий8</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Доступ</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИИТ_МОЛыСДоступомКОбъекту</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИИТ_РасчетныеСчетаПоУмолчанию</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/АтрибутыПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>АтрибутыПроектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДлительностьДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Проекты/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаКлиенте
Процедура АЛФ_ПриОткрытииПеред(Отказ)

	//Перенос доработок содержимое процедуры целиком
	Если СпособОтображения <> "" Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы[СтрЗаменить(Строка(СпособОтображения), " ", "")];
	КонецЕсли;	
	
	Попытка
		Если ЭтаФорма.ВладелецФормы.Родитель.ИмяФормы = "Документ.ИИТ_ЕжедневныйТабельУчета.Форма.ФормаДокумента" И ЭтаФорма.ВладелецФормы.Имя = "ТабДокумент" Тогда

			ОбъектРодитель = ЭтаФорма.ВладелецФормы.Родитель.Объект.ОбъектСтроительства;
			Элементы.Список.Отображение = ОтображениеТаблицы.Список;
			
			ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
			ЭлементОтбора.ПравоеЗначение = ОбъектРодитель;

			ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Проект");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Ложь;
	
		КонецЕсли;
	Исключение
	КонецПопытки;        
	//Конец переноса

КонецПроцедуры

&НаСервере 
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура АЛФ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
#Вставка
	//Переопределение запроса
	ТекстЗапроса = "ВЫБРАТЬ
			|	СправочникПроекты.Ссылка КАК Ссылка,
			|	СправочникПроекты.ПометкаУдаления КАК ПометкаУдаления,
			|	СправочникПроекты.Родитель КАК Родитель,
			|	СправочникПроекты.Код КАК Код,
			|	СправочникПроекты.Наименование КАК Наименование,
			|	ЕСТЬNULL(АтрибутыПроектов.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) КАК Поле1,
			|	ЕСТЬNULL(АтрибутыПроектов.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК Поле2,
			|	ЕСТЬNULL(АтрибутыПроектов.ДлительностьДней, 0) КАК Поле3,
			|	СправочникПроекты.Ответственный КАК Ответственный,
			|	СправочникПроекты.Комментарий КАК Комментарий,
			|	СправочникПроекты.ОсновнаяСтатьяДвиженияДенежныхСредств КАК ОсновнаяСтатьяДвиженияДенежныхСредств,
			|	СправочникПроекты.ОсновнаяСтатьяДоходовИРасходов КАК ОсновнаяСтатьяДоходовИРасходов,
			|	СправочникПроекты.Организация КАК Организация,
			|	СправочникПроекты.ОсновнойКонтрагент КАК ОсновнойКонтрагент,
			|	СправочникПроекты.ОсновнойДоговорКонтрагента КАК ОсновнойДоговорКонтрагента,
			|	СправочникПроекты.ОсновнаяВалютаПлатежей КАК ОсновнаяВалютаПлатежей,
			|	СправочникПроекты.Состояние КАК Состояние,
			|	СправочникПроекты.Предопределенный КАК Предопределенный,
			|	СправочникПроекты.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
			|	СправочникПроекты.ФункциональноеНаправление КАК ФункциональноеНаправление,
			|	СправочникПроекты.Проект КАК Проект,
			|	СправочникПроекты.РазделИнвестиционнойПрограммы КАК РазделИнвестиционнойПрограммы,
			|	СправочникПроекты.ПроектЭтапа КАК ПроектЭтапа
			|ИЗ
			|	Справочник.Проекты КАК СправочникПроекты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АтрибутыПроектов КАК АтрибутыПроектов
			|		ПО (АтрибутыПроектов.Проект = СправочникПроекты.Ссылка)
			|			И (АтрибутыПроектов.Сценарий = ЗНАЧЕНИЕ(Справочник.Сценарии.План))
			|ГДЕ
			|	(СправочникПроекты.Ссылка В ИЕРАРХИИ (&МассивОС)
			|			ИЛИ &ДоступныВсеОС)";
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица = "Справочник.Проекты";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список,
		СвойстваСписка);  	 
		
	МассивОС = ИИТ_ВспомогательныеФункцииСервер.ПолучитьМассивДоступныхПроектов();
	Список.Параметры.УстановитьЗначениеПараметра("МассивОС", МассивОС);
	Список.Параметры.УстановитьЗначениеПараметра("ДоступныВсеОС", РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ИИТ_ПолноеЧтение")
												ИЛИ РольДоступна("ИИТ_ФинСлужба") ИЛИ РольДоступна("ИИТ_РуководительСнабжения") ИЛИ РольДоступна("ИИТ_Снабжение"));
#КонецВставки	
	Если Параметры.Отбор.Свойство("Родитель") И ЗначениеЗаполнено(Параметры.Отбор.Родитель)
		ИЛИ (Параметры.Отбор.Свойство("Проект") И НЕ Параметры.Отбор.Проект) Тогда
		Элементы.Список.Отображение=ОтображениеТаблицы.Список;
	Иначе
		Элементы.Список.Отображение=ОтображениеТаблицы.ИерархическийСписок;
	КонецЕсли;
	
	ТолькоПроекты = Параметры.ВыборТолькоПроектов;
	ТолькоЭтапы   = Параметры.ВыборТолькоЭтапов;
    #Вставка
	Если Параметры.Свойство("ОтображениеСписка") Тогда											
		СпособОтображения = Строка(Параметры.ОтображениеСписка);
	КонецЕсли;
#КонецВставки
КонецПроцедуры
